Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Regular-file file wrapper initialized from serialized Representation.
ja: serialized Representationから初期化される通常ファイルファイルラッパー。

source: Reject all cookies.
ja: 全てのクッキーを拒絶します。

source: Related Documentation
ja: 関連文書

source: Related String Types
ja: 関連した文字列型

source: Related Types
ja: 関連する型

source: Relationships
ja: 関係

source: Releases each element but doesn’t deallocate table.
ja: 各要素を解放します、しかしtableをデアロケートしません。

source: Releases each element of the specified hash table and frees the table itself.
ja: 指定されたハッシュテーブルの各要素を解除して、テーブルそれ自体を解放します。

source: Releases each key and value but doesn’t deallocate table.
ja: キーと値のそれぞれを解放します、しかしtableをデアロケートしません。

source: Releases each key and value of the specified map table and frees the table itself.
ja: 指定されたマップテーブルの各キーと値を解除して、テーブルそれ自体を解放します。

source: Remember that NSArray is the public interface for a class cluster and what this entails for your subclass.
ja: NSArrayはクラスクラスタに対するパブリックインターフェイスであること、そしてあなたのサブクラスに課せられるのは何かを忘れないでください。

source: Remember that deleting items from iCloud cannot be undone.
ja: iCloudからの項目の削除は、取り消しが不可能なのを忘れないでください。

source: Remove a range of integers from the Index Set.
ja: いくつかの整数からなるある範囲を Index Setから除去します。

source: Remove all underscores that aren't at the very start or end of the string.
ja: 文字列のほんとうの始まりまたは終わりのアンダースコア全てを除去します。

source: Remove all values from the Index Set.
ja: すべての値をIndex Setから除去します。

source: Remove an integer from the Index Set.
ja: ある整数をIndex Setから除去します。

source: Remove the values from the specified string from the Character Set.
ja: 指定された文字列からの値をCharacter Setから取り除きます。

source: Removed items are deleted immediately and not placed in the Trash.
ja: 除去された項目は、直ぐに削除されます、そしてゴミ箱に置かれません。

source: Removes a child file wrapper from the receiver, which must be a directory file wrapper.
ja: 子ファイルラッパーをレシーバから取り除きます、それはディレクトリファイルラッパーでなければなりません。

source: Removes a key and corresponding value from the specified table.
ja: キーとそれに対応している値を、指定されたテーブルから除去します。

source: Removes all elements from the collection.
ja: 全ての要素をコレクションから除去します。

source: Removes all elements of this option set that are not also present in the given set.
ja: このオプションセットに属し、また与えられたセットの中に含まれない、すべての要素を除去します。

source: Removes an element from the specified hash table.
ja: 指定されたハッシュテーブルから要素を除去します。

source: Removes and returns the element at the specified position.
ja: 指定された位置での要素を除去して返します。

source: Removes and returns the first element of the collection.
ja: コレクションの最初の要素を除去して返します。

source: Removes and returns the last element of the collection.
ja: コレクションの最後の要素を除去して返します。

source: Removes matching entries from the receiver’s dispatch table.
ja: 合致する登録項目をレシーバのディスパッチテーブルから取り除きます。

source: Removes the descriptor at the specified (one-based) position in the receiving descriptor list.
ja: 記述子をレシーバである記述子リストの中の指定された位置（１起点）で取り除きます。

source: Removes the elements in the specified subrange from the collection.
ja: 指定された下位範囲中のいくらかの要素をコレクションから除去します。

source: Removes the elements of the given set from this set.
ja: 与えられた集合の要素をこの集合から除去します。

source: Removes the file or directory at the specified URL.
ja: ファイルとディレクトリを指定されたURLで除去します。

source: Removes the file or directory at the specified path.
ja: ファイルとディレクトリを指定されたパスで除去します。

source: Removes the given element and all elements subsumed by it.
ja: 与えられた要素とそれによって包括されるすべての要素を除去します。

source: Removes the given number of elements from the end of the collection.
ja: 与えられた数の要素をコレクションの終わりから除去します。

source: Removes the local copy of the specified cloud-based item.
ja: 指定されたクラウド基盤の項目のローカルコピーを除去します。

source: Removes the object at the specified index from the collection specified by the passed key.
ja: 渡されたキーによって指定されたコレクションから、指定されたインデックスでオブジェクトを除去します。

source: Removes the receiver’s descriptor identified by the specified keyword.
ja: レシーバの持つ、指定されたキーワードで識別される記述子を除去します。

source: Removes the receiver’s parameter descriptor identified by the specified keyword.
ja: 指定されたキーワードで識別されるレシーバの持つパラメータ記述子を除去します。

source: Removes the specified number of elements from the beginning of the collection.
ja: 指定された数の要素をコレクションの始まりから除去除します。

source: Removes the specified number of elements from the end of the collection.
ja: 指定された数の要素をコレクションの終わりから除去します。

source: Removing Bytes
ja: バイトの削除

source: Removing Characters
ja: 文字を削除する

source: Removing Elements
ja: 要素の削除

source: Removing Nodes
ja: ノードを除去する

source: Removing an Item
ja: 項目の削除

source: Removing an item also removes all old versions of that item, invalidating any URLs returned by the url(for Publishing Ubiquitous Item At: expiration:) method to old versions.
ja: ある項目の除去はその項目の古いバージョンすべても除去します、古いバージョンに対してurl(for Publishing Ubiquitous Item At: expiration:)メソッドによって返されるあらゆるURLを無効にします。

source: Reorders the elements of the collection such that all the elements that match the given predicate are after all the elements that don’t match.
ja: コレクションの要素を再配列します、例えば、与えられた述部にマッチする要素すべてが、合致しない要素すべての後になるなど。

source: Replaces a region of bytes in the data with bytes from memory.
ja: データの中のある領域のバイトを、メモリからのバイトで置き換えます。

source: Replaces a region of bytes in the data with new bytes from a buffer.
ja: データの中のある領域のバイトを、あるバッファからの新しいバイトで置き換えます。

source: Replaces a region of bytes in the data with new bytes from a collection.
ja: データの中のある領域のバイトを、あるコレクションからの新しいバイトで置き換えます。

source: Replaces a region of bytes in the data with new data.
ja: データの中のある領域のバイトを新しいデータで置き換えます。

source: Replaces regular expression matches within the mutable string using the template string.
ja: テンプレート文字列を使用して、可変文字列内の正規表現マッチを取り替えます。

source: Replaces the contents of the item at the specified URL in a manner that ensures no data loss occurs.
ja: データ損失が生じないことを保証する流儀で、指定されたURLで項目の内容を置き換えます。

source: Replaces the given index with its predecessor.
ja: 与えられたインデックスをそれの前のものと取り替えます。

source: Replaces the given index with its successor.
ja: 与えられたインデックスをそれの後に続くものと取り替えます。

source: Replaces the object at the specified index in the collection specified by the passed key.
ja: 渡されたキーによって指定されたコレクションにおいて、指定されたインデックスでオブジェクトを置き換えます。

source: Replaces the receiver’s matrix with its inverse matrix.
ja: レシーバの行列をそれの逆行列で置き換えます。

source: Replaces the specified subrange of elements with the given collection.
ja: いくらかの要素からなる指定された下位範囲を与えられたコレクションで置き換えます。

source: Replaces this set with a new set containing all elements contained in either this set or the given set, but not in both.
ja: このセットを、このセットか与えられたセットのどちらかの中に、しかし両方ではなく、含まれるすべての要素を含んでいる新しいセットで置き換えます。

source: Replacing Strings Using Regular Expressions
ja: 正規表現を使って文字列を置換する

source: Replacing Substrings
ja: 下位文字列の置換

source: Replacing a Range of Bytes
ja: ある範囲のバイトを置き換える

source: Requests and Responses
ja: 要請と応答

source: Required.
ja: 必須。

source: Reset the index into the stream for the next read operation.
ja: ストリームへのインデックスを次の読み出し操作のために再設定してください。

source: Resetting this property can incur a significant performance cost, as it may cause internal state to be regenerated.
ja: このプロパティを規定値に戻すことは、かなりの性能経費を招きかねません、それが内部状態を再生されることを引き起こすかもしれないので。

source: Resources
ja: リソース

source: Resources may be tagged for a specific device (~iphone, ~ipad) or for a specific screen resolution (@2x, @3x).
ja: リソースは、特定のデバイスに対して（~iphone、~ipad）または特定の画面解像度に対して（@2x、@3x）タグをつけられるかもしれません。

source: Respond to problem situations in your interactions with APIs, and fine-tune your app for better debugging.
ja: APIとのあなたの相互作用での問題状況に応答します、そしてより良いデバッグのためにあなたのアプリを微調節します。

source: Result dates have an integer number of seconds (as if 0 was specified for the nanoseconds property of the Date Components matching parameter), unless a value was set in the nanoseconds property, in which case the result date will have that number of nanoseconds (or as close as possible with floating point numbers).
ja: 結果の日付は整数の秒を持ちます（まるで０がDate Componentsマッチングパラメータのnanosecondsプロパティに指定されたかのように)、値がnanosecondsプロパティに設定された場合を除き、その場合には結果の日付はその値の（または浮動小数点とできるだけ近い）ナノ秒数を持つでしょう。

source: Retaining the collection’s storage can be a useful optimization when you’re planning to grow the collection again.
ja: コレクションのストレージを保持することは、あなたがコレクションをもう一度増大しようと計画している時に、ひとつの有益な最適化であることができます。

source: Retrieves a named object from the collection specified by the passed key.
ja: 渡されたキーによって指定されたコレクションから、名前をつけられたオブジェクトを取ってきます。

source: Retrieves an indexed object from the collection specified by the passed key.
ja: 渡されたキーによって指定されたコレクションから、インデックスをつけられたオブジェクトを取ってきます。

source: Retrieves an object by ID from the collection specified by the passed key.
ja: 渡されたキーによって指定されたコレクションから、IDによってオブジェクトを取ってきます。

source: Retrieving Cookies
ja: クッキーを取ってくる

source: Return false if you cannot access data in the buffer; otherwise, return true.
ja: falseを返してください、もしあなたがバッファの中のデータにアクセスできないならば；そうでなければ、trueを返してください。

source: Return true if the conversion is successful.
ja: 変換が成功するならば、trueを返します。

source: Return true if there is more data to read in the stream, false if there is not.
ja: trueをもっとデータがストリームにおいて読み出すためにあるならば、ないならばfalseを返してください。

source: Return true if partial String Ptr is acceptable and false if partial String Ptr is unacceptable.
ja: trueをもしpartial String Ptrが受け入れ可能ならば、そしてfalseをpartial String Ptrが受け入れ可能でないならば返してください。

source: Return true if partial String is acceptable and false if partial String is unacceptable.
ja: trueをもしpartial Stringが受け入れ可能ならば、そしてfalseをpartial Stringが受け入れ可能でないならば返してください。

source: Return Value
ja: 戻り値

source: Return a Range Set .Index> which can be used to subscript the index set.
ja: Range Set .Index>を返します、それはインデックス集合の添え字として使われることができます。

source: Return a new index path containing all but the last element.
ja: 最後の要素の他は全て含んでいる新しいインデックスパスを返します。

source: Return a user script task instance given a URL for a script file.
ja: スクリプトファイルへのURLを与えられるユーザスクリプトタスクインスタンスを返します。

source: Return by reference in the second parameter the number of bytes actually put into the buffer.
ja: ２番目のパラメータにおいて参照によって実際にバッファの中に置かれるバイト数を返してください。

source: Return in 0(1) a pointer to the subclass-allocated buffer (first parameter).
ja: 0(1) においてサブクラスアロケートのバッファへにポインタを返してください。

source: Return the actual number of bytes placed in the buffer; if there is nothing left in the stream, return 0.
ja: バッファに置かれる実際のバイト数を返してください；ストリームに残されるものがないならば、0を返してください。

source: Returning an array with a single index where the index is –1 is interpreted to mean all the objects.
ja: ただ１つのインデックスを持つ配列を返してそのインデックスが-1であることは、すべてのオブジェクトを意味すると解釈されます。

source: Returns nil if an error occurs.
ja: エラーが起こるならばnilを返します。

source: Returns nil if larger is not logically bigger than smaller in the calendar, or the given combination of components does not make sense (or is a computation which is undefined).
ja: そのカレンダーにおいてより大きいものがより小さいものより論理的に大きくない、または与えられた構成要素の組み合わせが意味をなさない（またははっきりしない計算結果である）ならばnil。

source: Returns nil if the provided properties are invalid.
ja: nilを返します、もし提供されたプロパティが無効ならば。

source: Returns nil if there was an error reading the file.
ja: ファイル読み込みエラーがあったならばnil。

source: Returns nil otherwise.
ja: nilをそうでなければ返します。

source: Returns true if self contains integer.
ja: trueを返します、もしselfがintegerを含むならば。

source: Returns true if self contains all of the integers in index Set.
ja: trueを返します、もしselfがindex Setの中のすべての整数を含むならば。

source: Returns true if self contains all of the integers in range.
ja: trueを返します、もしselfがrangeの中のすべての整数を含むならば。

source: Returns true if self intersects any of the integers in range.
ja: trueを返します、もしselfがrangeの中の整数のいくらかと交わるならば。

source: Returns true if the energy is used to measure food energy; otherwise, false.
ja: trueを、エネルギーが食品エネルギーを計るために使われるならば返します；そうでなければ、false。

source: Returns true if this cookie should only be sent via HTTP headers, false otherwise.
ja: trueを返します、もしこのクッキーがHTTPヘッダ経由でのみ送られるべきならば、そうでなければfalse。

source: Returns true if, in a scripting comparison, the compared object contains object.
ja: trueを返します、もしスクリプティング比較において、比較されるオブジェクトがobjectを含むならば。

source: Returns true if, in a scripting comparison, the compared object is equal to object.
ja: trueを返します、もしスクリプティング比較において、比較されるオブジェクトがobjectに等しいならば。

source: Returns true if, in a scripting comparison, the compared object is greater than object.
ja: trueを返します、もしスクリプティング比較において、比較されるオブジェクトがobjectより大きいならば。

source: Returns true if, in a scripting comparison, the compared object is greater than or equal to object.
ja: trueを返します、もしスクリプティング比較において、比較されるオブジェクトがobjectより大きいか等しいならば。

source: Returns true if, in a scripting comparison, the compared object is less than object.
ja: trueを返します、もしスクリプティング比較において、比較されるオブジェクトがobjectより小さいならば。

source: Returns true if, in a scripting comparison, the compared object is less than or equal to object.
ja: trueを返します、もしスクリプティング比較において、比較されるオブジェクトがobjectより小さいか等しいならば。

source: Returns true if, in a scripting comparison, the compared object matches the beginning of object.
ja: trueを返します、もしスクリプティング比較において、比較されるオブジェクトがobjectの始まりにマッチするならば。

source: Returns true if, in a scripting comparison, the compared object matches the end of object.
ja: trueを返します、もしスクリプティング比較において、比較されるオブジェクトがobjectの終わりにマッチするならば。

source: Returns {NSNot Found, 0} if no match is found.
ja: マッチが見つけられないならば{NSNot Found, 0}を返します。

source: Returns false if either a Rect or b Rect has a width or height that is 0.
ja: false、もしa Rectまたはb Rectのどちらかが０の幅または高さを持つならば。

source: Returns false (0) if reading is not successful.
ja: 読み出しが成功しないならば、false (0)。

source: Returns false if an error occurred.
ja: エラーが発生したならばfalseを返します。

source: Returns nil if the file wrapper specified in child is not a child of the directory.
ja: nilを返します、もしchildにおいて指定されたファイルラッパーがディレクトリの子でないならば。

source: Returns nil if the file can’t be opened or if the contents of the file can’t be parsed into an array.
ja: そのファイルが開かれることができないならば、またはファイルの内容が配列へと構文解析されることができないならば、nilを返します。

source: Returns nil if the location can’t be opened or if the contents of the location can’t be parsed into an array.
ja: その場所が開かれることができないならば、または場所の内容が配列へと構文解析されることができないならばnilを返します。

source: Returns false if a file, directory, or symbolic link identical to path already exists.
ja: falseを、もし既にpathとまったく同じファイル、ディレクトリ、またはシンボリックリンクが存在するならば返します。

source: Returns nil if object is not of the correct class.
ja: nilを返してください、もしobjectが正しいクラスでないならば。

source: Returns nil if path does not exist.
ja: パスが存在しないならばnilを返します。

source: Returns nil if the directory specified at path does not exist or there is some other error accessing it.
ja: nilを返します、もしpathで指定されるディレクトリが存在しないまたは何か他のエラーがそれにアクセスすることであるならば。

source: Returns nil if class Name is not one of the classes associated with the receiver or if there is an error loading the executable code containing the class implementation.
ja: nilを返します、もしclass Nameがレシーバと結びつけられたクラスのうちの１つでないならば、またはクラス実装を含んでいる実行可能コードをロードするエラーがあるならば。

source: Returns Base-64 encoded data.
ja: Base-64エンコーディングデータを返します。

source: Returns a CGPoint typecast from an NSPoint.
ja: NSPointから型キャストされた、CGPointを返します。

source: Returns a CGRect typecast from an NSRect.
ja: NSRectから型キャストされた、CGRectを返します。

source: Returns a CGSize typecast from an NSSize.
ja: NSSizeから型キャストされたCGSizeを返します。

source: Returns a Character Set created by removing elements in other from self.
ja: otherの中の要素をselfから取り除くことで作成されるCharacter Setを返します。

source: Returns a Date Interval of the next weekend, which starts strictly after the given date.
ja: 次の週末のDate Intervalを返します、それは与えられた日付の厳密に後で開始します。

source: Returns a Date Interval of the weekend contained by the given date, or nil if the date is not in a weekend.
ja: 与えられた日付によって含まれる、週末のDate Intervalを、またはその日付が週末の中にないならばnilを返します。

source: Returns a Range-based view of self.
ja: Rangeに基づく、selfのビューを返します。

source: Returns a Range-based view of the entire contents of self.
ja: Rangeに基づいた、selfの内容全体のビューを返します。

source: Returns a Base-64 encoded string.
ja: Base-64エンコードされた文字列を返します。

source: Returns a Boolean indicating whether the item is targeted for storage in iCloud.
ja: 項目がiCloudのストレージを目標としているかどうかを指し示すブール値を返します。

source: Returns a Boolean indicating whether two calendars are the same.
ja: ２つのカレンダーが同じかどうかを指し示すブール値を返します。

source: Returns a Boolean that indicates whether a given decimal contains a valid number.
ja: 与えられた10進数が有効な数を含んでいるかどうかを指し示すブール値を返します。

source: Returns a Boolean that indicates whether two size values are equal.
ja: ２つのサイズ値が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean that is true if all nodes of the first index path are equal to those of the second in order.
ja: 最初のインデックスパスのノードすべてが順番で２番目のそれらと等しいならばtrueを返すブール。

source: Returns a Boolean that is true if the first index path is greater than the second when comparing elements in depth-first traversal order.
ja: 深さ優先横断順で要素を比較する場合、最初のインデックスパスが２番目より大きいならばtrueであるブール値を返します。

source: Returns a Boolean that is true if the first index path is less than the second when comparing elements in depth-first traversal order.
ja: 深さ優先横断順で要素を比較する場合、最初のインデックスパスが２番目より少ないならばtrueであるブール値を返します。

source: Returns a Boolean that is true if the left hand date is earlier in time than the right hand date.
ja: 左手側の日付が右手側の日付より時間でより早いならばtrueであるブール値を返します。

source: Returns a Boolean that is true if the left hand date is later in time than the right hand date.
ja: 左手側の日付が右手側の日付より時間でより遅いならばtrueであるブール値を返します。

source: Returns a Boolean that is true if the two date values represent the same point in time.
ja: ２つの日付値が同じ時点を表すならばtrueであるブール値を返します。

source: Returns a Boolean value indicating whether a date is within the same day as another date.
ja: ある日付が別の日付と同じ日にちの内であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether an assistive technology is focused on the accessibility element.
ja: ある補助技術がアクセシビリティ要素にフォーカスされたかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether one decimal number is strictly less than another.
ja: ある10進法数が別のものより真に小さいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether or not two data buffers are equivalent.
ja: ２つのデータバッファが等しいか否かを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the bundle’s executable code could be loaded successfully.
ja: バンドルの持つ実行可能コードがうまくロードされることができたかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given date is within a weekend period.
ja: 与えられた日付が週末期間の内であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given date is within today.
ja: 与えられた日付が今日の内であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given date is within tomorrow.
ja: 与えられた日付が明日の内であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given date is within yesterday.
ja: 与えられた日付が昨日の内であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are equivalent to the elements in another sequence, using the given predicate as the equivalence test.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同等かどうかを、与えられた述部を同等性テストとして使って指し示すブール値を返します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are the same as the elements in another sequence.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同じかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the receiver should be ignored in the parent-child accessibility hierarchy.
ja: レシーバが親子アクセシビリティ階層において無視されるべきかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains an element that satisfies the given predicate.
ja: 指定された述部を満足させるある要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains the given element.
ja: 指定された要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the given predicate to compare elements.
ja: シーケンスが別のシーケンスの前に来るかどうかをある語彙筆記的順序（字典）順序において、与えられた述部を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the less-than operator (<) to compare elements.
ja: そのシーケンスが別のシーケンスの前に来るかどうかを、ある語彙筆記的順序（字典）順序において、より小さい演算子（<）を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether this instance should precede the given value in an ascending sort.
ja: このインスタンスがある昇順ソートにおいて与えられた値より前にくるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain equivalent elements in the same order, using the given predicate as the equivalence test.
ja: このシーケンスともう一方のシーケンスが同等の要素を同じ順序で含むかどうかを、与えられた述部を同等テストとして使って、指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain the same elements in the same order.
ja: このシーケンスともう一方のシーケンスが同じ要素を同じ順序で含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two dates are equal down to the specified component.
ja: 指定された構成要素へと至るまで２つの日付が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two decimal numbers are equal.
ja: ２つの10進法数が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values are not equal.
ja: ２つの値が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether a file or directory exists at a specified path.
ja: ファイルまたはディレクトリが指定されたパスで存在するかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether a given element is a member of the option set.
ja: 与えられた要素がオプションセットのメンバであるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether a given object is present in the array.
ja: 与えられたオブジェクトがその配列に存在するかどうかを示すブール値を返します。

source: Returns a Boolean value that indicates whether a given point is in a given rectangle.
ja: 与えられた点が与えられた矩形の中にあるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether a given rectangle is empty.
ja: 与えられた矩形が空であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether a partial string is valid.
ja: 不完全な文字列が有効かどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether a specified position is in a given range.
ja: 与えられた位置が与えられた範囲の中にあるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether instances of the receiver are capable of responding to a given selector.
ja: レシーバのインスタンスが指定したセレクタに応答する能力があるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether one rectangle completely encloses another.
ja: ある１つの矩形が完全に別のものを取り囲むかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether receiver is considered to be “like” a given string when the case of characters in the receiver is ignored.
ja: レシーバの中の文字の大文字小文字が無視される場合に、与えられた文字列に「似ている」とレシーバが見なされるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the elements of two hash tables are equal.
ja: ２つのハッシュテーブルのそれら要素が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the files or directories in specified paths have the same contents.
ja: 指定されたパスそれらでのファイルまたはディレクトリが同じ内容を持つかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the invoking object appears able to delete a specified file.
ja: 発動しているオブジェクトが、指定されたファイルを消去する能力を備えるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the invoking object appears able to read a specified file.
ja: 発動しているオブジェクトが指定されたファイルを読み込む能力を備えるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the invoking object appears able to write to a specified file.
ja: 発動しているオブジェクトが指定されたファイルに書き出す能力を備えるかどうかを指し示すブール値を返します。
